
def caching_fibonacci():
    """
    Функція caching_fibonacci створює та повертає вкладену функцію fibonacci(n),
    яка використовує кешування для оптимізації обчислення чисел Фібоначчі.

    Внутрішня функція fibonacci(n):
    - Використовує рекурсивний підхід для обчислення n-го числа Фібоначчі.
    - Зберігає вже обчислені значення в кеші (словнику cache), щоб уникнути зайвих обчислень.
    - Повертає збережене значення, якщо воно вже є в кеші.
    - Якщо значення ще не обчислене, рекурсивно обчислює його, зберігає в кеші та повертає результат.

    Повертає:
        - Функцію fibonacci(n), яку можна використовувати для обчислення чисел Фібоначчі.
    """
    cache = {}  


    def fibonacci(n):

        """
        Обчислює n-те число Фібоначчі з використанням кешування.

        Аргументи:
        n (int): Порядковий номер числа Фібоначчі.

        Повертає:
        int: Значення n-го числа Фібоначчі.
        """
        if n <= 0:
            return 0 
        if n == 1:
            return 1 
        if n in cache:
            return cache[n]  

        cache[n] = fibonacci(n - 1) + fibonacci(n - 2)
        return cache[n]

    return fibonacci 


print(caching_fibonacci()(17))  

